# 题目1：一维花式索引
# 创建 a = np.arange(20)，完成：
# 取出第 3、7、11、15 个元素。
# 倒序取出第 5、2、9 个元素（按这个顺序输出）。
# 用花式索引把第 0、1、2 个元素改成 100。
# 题目2：二维花式索引
# 创建 m = np.arange(1, 17).reshape(4, 4)，完成：
# 取出第 1 行、第 3 行。
# 取出 (0,0)、(1,1)、(2,2)、(3,3) 的元素（对角线）。
# 把 (0,3)、(1,2)、(2,1)、(3,0) 的元素改成 -1（反对角线）。
# 题目3（进阶）：切片 vs 花式索引
# 创建 a = np.arange(10)：
# 用切片取出 [2,3,4,5]。
# 用花式索引取出 [2,3,4,5]。
# 修改切片结果 → 是否影响原数组？
# 修改花式索引结果 → 是否影响原数组？
# 题目1
import numpy as np
print(f"————————————————————————————题目1开始————————————————————————————")
a1=np.arange(20)
b1=a1[[3,7,11,15]]
print(f"第 3、7、11、15 个元素为:\n{b1}")
c1=a1[[5,2,9]]
# c1 = a1[[5,2,9]][::-1]   # 先取，再倒序
print(f"第 5、2、9 个元素为:\n{c1}")
a1[[0,1,2]]=100
print(f"第 0、1、2 个元素改成 100为:\n{a1}")
print(f"————————————————————————————题目1结束————————————————————————————")
print(f"————————————————————————————题目2开始————————————————————————————")
a2=np.arange(1,17).reshape(4,4)
print(f"a2初始矩阵为\n{a2}")
b2=a2[[0,2]]
# b2 = a2[[0,2], :]   # 行号指定，列全取
print(f"a2取出第 1 行、第 3 行为\n{b2}")
c2=a2[[0,1,2,3],[0,1,2,3]]
print(f"a2取出 (0,0)、(1,1)、(2,2)、(3,3) 的元素为\n{c2}")
a2[[0,1,2,3],[3,2,1,0]]=-1
print(f"把 (0,3)、(1,2)、(2,1)、(3,0) 的元素改成 -1为\n{a2}")
print(f"————————————————————————————题目2结束————————————————————————————")
print(f"————————————————————————————题目3开始————————————————————————————")
a3 = np.arange(10)
b3=a3[2:6]
print(f"a3切片取出 [2,3,4,5]元素为\n{b3}")
c3=a3[[2,3,4,5]]
print(f"a3花式索引取出 [2,3,4,5]元素为\n{c3}")
a3[2:6]=0
print(f"a3切片修改 [2,3,4,5]元素后a3为\n{a3}")
c3[0]=100
print(f"a3花式索引修改 [2,3,4,5]元素后a3为\n{a3}")
# c3 = a3[[2,3,4,5]]
# c3[0] = 100
# print("c3 修改后：", c3)
# print("a3 是否变化？", a3)

