'''题目1：一维步长切片
创建 a = np.arange(15)，完成以下任务：
取出所有奇数位置的元素。
将数组倒序输出。
取出索引 12 到 3（不含 3），步长为 -3 的切片。
题目2：二维步长切片
创建 m = np.arange(1, 17).reshape(4,4)，即：
[[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]
 [13 14 15 16]]
取出奇数行（第 2、4 行）。
取出偶数列（第 1、3 列）。
将矩阵倒序输出（上下翻转 + 左右翻转）。
题目3：切片赋值
在 a = np.arange(10) 中：
将前 5 个元素都改成 -1。
将后 5 个元素替换成 [50, 51, 52, 53, 54]。
将所有偶数索引位置的元素加 100。
题目4（加分）：切片 vs 布尔索引
创建 a = np.arange(10)：
定义 b = a[2:8]（切片），修改 b[0] = 99，观察 a。
定义 c = a[a>5]（布尔索引），修改 c[0] = 77，观察 a。
👉 思考：为什么 b 修改影响 a，而 c 修改不影响？'''
print(f"————————————————————————————题目1开始————————————————————————————")
# 题目1
import numpy as np
a1=np.arange(15)
print(f"a1=\n{a1}")
b1=a1[1::2]
print(f"b1=\n{b1}")
c1=a1[::-1]
print(f"c1=\n{c1}")
d1=a1[12:3:-3]
print(f"d1=\n{d1}")
print(f"————————————————————————————题目1结束————————————————————————————")
print(f"————————————————————————————题目2开始————————————————————————————")
# 题目2
m2 = np.arange(1, 17).reshape(4,4)
print(f"m2=\n{m2}")
b2=m2[1::2,::]
# :: 可以省略成 :，比如 m2[1::2, :] 更简洁。
print(f"奇数索引行b2=\n{b2}")
c2=m2[::,::2]
print(f"偶数索引列c2=\n{c2}")
d2=m2[::-1,::-1]
print(f"倒序输出d2=\n{d2}")
print(f"————————————————————————————题目2结束————————————————————————————")
print(f"————————————————————————————题目3开始————————————————————————————")
# 题目3
# 初始化数组
a3 = np.arange(10)
print("原始数组:\n", a3)
#前5个元素改为-1
b3 = a3.copy()
b3[0:5] = -1
# [0:5] 可以写成 [:5]，更简洁。
print("前5个元素改为-1:\n", b3)
#后5个元素替换为[50, 51, 52, 53, 54]
c3 = a3.copy()
c3[5:] = [50, 51, 52, 53, 54]
# 后 5 个元素可以用 np.arange(50, 55) 代替手写 [50, 51, 52, 53, 54]，可读性更高，也更灵活。
print("后5个元素替换:\n", c3)
#偶数索引元素加100
d3 = a3.copy()
d3[::2] += 100
print("偶数索引元素加100:\n", d3)
print(f"————————————————————————————题目3结束————————————————————————————")
print(f"————————————————————————————题目4开始————————————————————————————")
# 题目4
a4=np.arange(10)
print(f"原始a4=\n{a4}")
b4=a4[2:8]
b4[0]=99
print(f"观察直接切片修改后a4=\n{a4}")
c4=a4[a4>5]
print(f"布尔索引c4=\n{c4}")
c4[0] = 77
print(f"布尔索引修改c4=\n{c4}")
print(f"观察布尔索引修改后a4=\n{a4}")
# 布尔索引相当于copy了一个矩阵，创建了新的内存地址 而直接切片则是一个view 未生成新的内存地址 直接修改会影响原始矩阵的内存地址
print(f"————————————————————————————题目4结束————————————————————————————")
