# ✏️ Day28 练习题
# 题目1：标量与数组运算
# 创建一个 a = np.arange(1,10).reshape(3,3)
# 每个元素加 5。
# 每个元素平方。
# 题目2：一维 vs 二维广播
# 创建 a = np.array([1,2,3]) 和 b = np.array([[10],[20],[30]])：
# 计算 a + b，并写出广播过程。
# 计算 a * b。
# 题目3：行列广播
# 创建 m = np.arange(12).reshape(3,4)：
# 让 m 的每一列都加上 [10,20,30]（按行加）。
# 让 m 的每一行都加上 [1,2,3,4]（按列加）。
# 题目4（进阶）：综合练习
# 假设有一个 成绩矩阵 scores = np.array([[80,90,70],[60,75,85],[90,95,100]])，
# 和一个 加分数组 bonus = np.array([5,10,0])（表示对每门课加的分数）。
# 请用广播机制实现加分，得到新的成绩矩阵。
import numpy as np
from numpy.ma.extras import mask_rows

print(f"∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷题目1开始∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷")
a1=np.arange(1,10).reshape(3,3)
b1=a1+5
c1=a1**2
print(f"初始矩阵\n{a1}\n每个元素加5的结果是\n{b1}\n每个元素平方的结果是\n{c1}")
print(f"∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷题目1结束∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷")
print(f"∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷题目2开始∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷")
a2=np.array([1,2,3])
b2=np.array([[10],[20],[30]])
c2=a2+b2
# a2为（3，）b2为（3，1）从后往前对齐 广播后
# b2: (3,1) → [[10],[20],[30]]
# a2: (3,)  → [[1,2,3]]
# 最终扩展：
# [[10,10,10],
#  [20,20,20],
#  [30,30,30]] + [[1,2,3]]

print(f"a2和b2分别为\n{a2}\n{b2}\n")
print(f"a + b=\n{c2}")
d2=a2*b2
print(f"a * b=\n{d2}")
print(f"∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷题目2结束∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷")
print(f"∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷题目3开始∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷")
m = np.arange(12).reshape(3,4)
row=np.array([10,20,30]).reshape(3,1)
print(f"m为\n{m}\n")
print(f" m 的每一列都加上 [10,20,30]（按行加）结果为\n{m+row}")
col=np.array([1,2,3,4])
print(f" m 的每一行都加上 [1,2,3,4]（按列加）结果为\n{m+col}")
print(f"∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷题目3结束∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷")
print(f"∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷题目4开始∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷")
scores = np.array([[80, 90, 70], [60, 75, 85], [90, 95, 100]])
bonus = np.array([5,10,0])
new_scores=scores+bonus
# bonus = np.array([5,10,0]).reshape(1,3)
print(f"原始成绩矩阵:\n{scores}\n加分数组:\n{bonus}\n加分后的成绩矩阵:\n{new_scores}")
print(f"∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷题目4结束∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷")

